---
kind: property
id: P:Autodesk.Revit.DB.SaveAsOptions.OverwriteExistingFile
source: html/0cb74cf6-c265-20d6-467e-30b89aa60237.htm
---
# Autodesk.Revit.DB.SaveAsOptions.OverwriteExistingFile Property

Identifies if the operation should be able to overwrite an existing file.

## Syntax (C#)
```csharp
public bool OverwriteExistingFile { get; set; }
```